disp('++++++++++++++++++++++++++++++')
disp('–â‘è 3.5 (1)')
disp('++++++++++++++++++++++++++++++')

clear
format compact

A = [ 0  1
     -3 -4 ];

lambda = eig(A)

if real(lambda) < 0
    disp('‘Q‹ßˆÀ’è‚Å‚ ‚é')
else
    disp('‘Q‹ßˆÀ’è‚Å‚Í‚È‚¢')
end


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
disp(' ')
disp('++++++++++++++++++++++++++++++')
disp('–â‘è 3.5 (2)')
disp('++++++++++++++++++++++++++++++')

clear
format compact

A = [ 0  1
     -2 -2 ];

lambda = eig(A)

if real(lambda) < 0
    disp('‘Q‹ßˆÀ’è‚Å‚ ‚é')
else
    disp('‘Q‹ßˆÀ’è‚Å‚Í‚È‚¢')
end

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
disp(' ')
disp('++++++++++++++++++++++++++++++')
disp('–â‘è 3.5 (3)')
disp('++++++++++++++++++++++++++++++')

clear
format compact

A = [ 0 -4
      1 -4 ];

lambda = eig(A)

if real(lambda) < 0
    disp('‘Q‹ßˆÀ’è‚Å‚ ‚é')
else
    disp('‘Q‹ßˆÀ’è‚Å‚Í‚È‚¢')
end

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
disp(' ')
disp('++++++++++++++++++++++++++++++')
disp('–â‘è 3.5 (4)')
disp('++++++++++++++++++++++++++++++')

clear
format compact

A = [ 0   1
      4  -3 ];

lambda = eig(A)

if real(lambda) < 0
    disp('‘Q‹ßˆÀ’è‚Å‚ ‚é')
else
    disp('‘Q‹ßˆÀ’è‚Å‚Í‚È‚¢')
end
