disp('++++++++++++++++++++++++++++++')
disp('問題 3.5 (1)')
disp('++++++++++++++++++++++++++++++')

clear
format compact

A = [ 0  1
     -3 -4 ];

lambda = eig(A)

if real(lambda) < 0
    disp('漸近安定である')
else
    disp('漸近安定ではない')
end


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
disp(' ')
disp('++++++++++++++++++++++++++++++')
disp('問題 3.5 (2)')
disp('++++++++++++++++++++++++++++++')

clear
format compact

A = [ 0  1
     -2 -2 ];

lambda = eig(A)

if real(lambda) < 0
    disp('漸近安定である')
else
    disp('漸近安定ではない')
end

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
disp(' ')
disp('++++++++++++++++++++++++++++++')
disp('問題 3.5 (3)')
disp('++++++++++++++++++++++++++++++')

clear
format compact

A = [ 0 -4
      1 -4 ];

lambda = eig(A)

if real(lambda) < 0
    disp('漸近安定である')
else
    disp('漸近安定ではない')
end

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
disp(' ')
disp('++++++++++++++++++++++++++++++')
disp('問題 3.5 (4)')
disp('++++++++++++++++++++++++++++++')

clear
format compact

A = [ 0   1
      4  -3 ];

lambda = eig(A)

if real(lambda) < 0
    disp('漸近安定である')
else
    disp('漸近安定ではない')
end
