disp('++++++++++++++++++++++++++++++')
disp('問題 C.3 (1)')
disp('++++++++++++++++++++++++++++++')

clear
format compact

disp(' ')
disp('--- 行列 A ------')
A = [ 2  0  0
      0  2  0 ]

disp(' ')
disp('--- A のランク ------')
rank(A)


disp(' ')
disp(' ')
disp('++++++++++++++++++++++++++++++')
disp('問題 C.3 (3)')
disp('++++++++++++++++++++++++++++++')

disp(' ')
disp('--- 行列 A ------')
A = [ 2  1  1
      3  1  2
      1  0  1 ]

disp(' ')
disp('--- A のランク ------')
rank(A)
