disp('++++++++++++++++++++++++++++++')
disp('問題 C.2 (1)（数式処理）')
disp('++++++++++++++++++++++++++++++')

clear
format compact

disp(' ')
disp('--- 行列 A ------')
A = [ 0  1
     -2 -3 ];
A = sym(A)

disp(' ')
disp('--- A の逆行列 ------')
inv_A = inv(A)


disp(' ')
disp(' ')
disp('++++++++++++++++++++++++++++++')
disp('問題 C.2 (2)（数式処理）')
disp('++++++++++++++++++++++++++++++')

disp(' ')
disp('--- 行列 A ------')
A = [ 0  1  2
      2 -1  0
     -2  0  2 ];
A = sym(A)

disp(' ')
disp('--- A の逆行列 ------')
inv_A = inv(A)
