clear
format compact

A = [ 0  1
      0  2 ];
b = [ 0
      1 ];
c = [ 1  0 ];


disp('++++++++++++++++++++++++++++++')
disp('問題 6.4 (1)')
disp('++++++++++++++++++++++++++++++')
disp(' ')
disp('--- A の固有値 ---------')
eig(A)

disp(' ')
disp('++++++++++++++++++++++++++++++')
disp('問題 6.4 (2)')
disp('++++++++++++++++++++++++++++++')
disp(' ')
disp('--- 状態フィードバックゲイン k ---------')
k = - acker(A,b,[-1+j,-1-j])

disp(' ')
disp('--- A + b*k の固有値 ---------')
eig(A + b*k)

disp(' ')
disp('++++++++++++++++++++++++++++++')
disp('問題 6.4 (3)')
disp('++++++++++++++++++++++++++++++')
disp(' ')
kd = - acker(A',c',[-2+2j,-2-2j]);

disp(' ')
disp('--- オブザーバゲイン l ---------')
l = kd'

disp(' ')
disp('--- A + l*c の固有値 ---------')
eig(A + l*c)

disp(' ')
disp('++++++++++++++++++++++++++++++')
disp('問題 6.4 (4)')
disp('++++++++++++++++++++++++++++++')
disp(' ')
Acl = [   A      b*k
        -l*c  A+b*k+l*c ]

disp(' ')
disp('--- Acl の固有値 ---------')
eig(Acl)
