disp(' ')
disp('++++++++++++++++++++++++++++++')
disp('問 8.2（数値解法：関数 ''care''）')
disp('++++++++++++++++++++++++++++++')

clear
format compact

A = [  0   1
     -10  -1 ];
B = [ 0
      1 ];
Q = diag([ 2400  144 ]);
R = 1;

disp(' ')
disp('--- リカッチ方程式の正定対称解 P --------');
P = care(A,B,Q,R)

disp(' ')
disp('--- u(t) = K*x(t) --------');
K = - inv(R)*B'*P

disp(' ')
disp('++++++++++++++++++++++++++++++')
disp('問 8.2（数値解法：関数 ''lqr''）')
disp('++++++++++++++++++++++++++++++')

clear
format compact

A = [  0   1
     -10  -1 ];
B = [ 0
      1 ];
Q = diag([ 2400  144 ]);
R = 1;

disp(' ')
disp('--- リカッチ方程式の正定対称解 P，ゲイン F = - K --------');
[F P] = lqr(A,B,Q,R)

disp(' ')
disp('--- u(t) = K*x(t) --------');
K = - F

disp(' ')
disp('++++++++++++++++++++++++++++++')
disp('問 8.2（数値解法：関数 ''lqr''）')
disp('++++++++++++++++++++++++++++++')

clear
format compact

A = [  0   1
     -10  -1 ];
B = [ 0
      1 ];
Q = diag([ 2400  144 ]);
R = 1;

disp(' ')
disp('--- u(t) = K*x(t) --------');
K = - lqr(A,B,Q,R)