disp('++++++++++++++++++++++++++++++')
disp('例 8.2 (2)（数値解法：関数 ''care''）')
disp('++++++++++++++++++++++++++++++')

clear
format compact

A = [  0   1
     -10  -1 ];
B = [ 0
      1 ];

for q1 = [10 100 1000]
    Q = diag([ q1  0 ]);
    R = 1;

    disp(' ')
    disp('=== q1 ================================');
    q1

    disp('--- リカッチ方程式の正定対称解 P --------');
    P = care(A,B,Q,R)

    disp('--- u(t) = K*x(t) --------');
    K = - inv(R)*B'*P

    disp('--- A + B*K の固有値--------');
    eig(A + B*K)
end

disp(' ')
disp('++++++++++++++++++++++++++++++')
disp('例 8.2 (1)（数値解法：関数 ''lqr''）')
disp('++++++++++++++++++++++++++++++')

clear
format compact

A = [  0   1
     -10  -1 ];
B = [ 0
      1 ];

for q1 = [10 100 1000]
    Q = diag([ q1  0 ]);
    R = 1;

    disp(' ')
    disp('=== q1 ================================');
    q1

    disp('--- リカッチ方程式の正定対称解 P，ゲイン F = - K --------');
    [F P] = lqr(A,B,Q,R)

    disp('--- u(t) = K*x(t) --------');
    K = - F

    disp('--- A + B*K の固有値--------');
    eig(A + B*K)
end


disp(' ')
disp('++++++++++++++++++++++++++++++')
disp('例 8.2 (1)（数値解法：関数 ''lqr''）')
disp('++++++++++++++++++++++++++++++')

clear
format compact

A = [  0   1
     -10  -1 ];
B = [ 0
      1 ];

for q1 = [10 100 1000]
    Q = diag([ q1  0 ]);
    R = 1;

    disp(' ')
    disp('=== q1 ================================');
    q1

    disp('--- u(t) = K*x(t) --------');
    K = - lqr(A,B,Q,R)

    disp('--- A + B*K の固有値--------');
    eig(A + B*K)
end
