disp('++++++++++++++++++++++++++++++')
disp('例 4.4（数式処理）')
disp('++++++++++++++++++++++++++++++')

clear
format compact

syms s

A = [ -3  1
       2 -2 ];
b = [ 2
      0 ];
c = [ 0  1 ];

disp(' ')
disp('___ ステップ 1 __________________________')

disp(' ')
disp('--- A の特性多項式 ---------')
det_A = det(s*eye(2) - A)

disp(' ')
disp('--- A の特性多項式：λ^2 + a1*λ + a0 ---------')
a0 = subs(det_A, s, 0)
a1 = subs(diff(det_A, s), s, 0)

disp(' ')
disp('___ ステップ 2 __________________________')

disp(' ')
disp('--- 可制御行列 Vc ---------')
Vc = ctrb(A,b);
Vc = sym(Vc)

disp(' ')
disp('--- Mc ---------')
Mc = [ a1  1
       1   0 ]

disp(' ')
disp('___ ステップ 3 __________________________')

disp(' ')
disp('--- 可制御標準形への変換行列 Tc ---------')
Tc = inv(Vc*Mc)


disp(' ')
disp('___ ステップ 4 __________________________')

disp(' ')
disp('--- 可制御標準形 ---------')
Ac = Tc*A*inv(Tc)
bc = Tc*b
cc = c*inv(Tc)


% -------------------------------------------------------
disp(' ')
disp(' ')
disp('<<<< Enter キーを押してください >>>>')
pause
disp(' ')
disp(' ')
disp('++++++++++++++++++++++++++++++')
disp('例 4.5（数式処理）')
disp('++++++++++++++++++++++++++++++')

disp(' ')
disp('--- 配置したい固有値の設定 ---------')
p = [ -8+4j
      -8-4j ]

disp(' ')
disp('--- Δ(λ) = λ^2 + d1*λ + d0  ---------')
delta = (s - p(1))*(s - p(2))

d0 = subs(delta, s, 0)
d1 = subs(diff(delta, s), s, 0)

disp(' ')
disp('--- u(t) = kc*xc(t) ---------')
kc = [ a0-d0  a1-d1 ]

disp(' ')
disp('--- u(t) = k*x(t) ---------')
k = kc*Tc

disp(' ')
disp('--- A + b*k の固有値 ---------')
eig(A + b*k)
