disp('++++++++++++++++++++++++++++++')
disp('問題 5.1 (1)')
disp('++++++++++++++++++++++++++++++')

clear
format compact

A = [ 0  1 
     -2  3 ];
b = [ 0
      1 ];
c = [ 1  0 ];

disp(' ')
disp('----- M0 ------')
M0 = [ A  b
       c  0 ]

disp(' ')
disp('----- |M0| ------')
det_M0 = det(M0)

if det_M0 == 0
    disp('M0 は正則ではない')
else
    disp('M0 は正則である')
end


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
disp(' ')
disp('++++++++++++++++++++++++++++++')
disp('問題 5.1 (2)')
disp('++++++++++++++++++++++++++++++')

disp(' ')
disp('--- 配置したい固有値の設定 ---------')
p = [ -5+5j
      -5-5j ]

disp(' ')
disp('----- u(t) = k*x(t) + h*yref ------')
k = -acker(A,b,p)

h = [ -k  1 ]*inv(M0)*[ zeros(2,1)
                           1      ]

disp(' ')
disp('----- A + b*k の固有値 ------')
eig(A + b*k)

