disp('++++++++++++++++++++++++++++++')
disp('例 C.3 (1)')
disp('++++++++++++++++++++++++++++++')

clear
format compact

disp(' ')
disp('--- 2 x 3 の行列 A ------')
A = [ 1  3  5
      2  6  5 ]

disp(' ')
disp('_____________________________________________')
disp('--- 行列 A の 2 x 2 の小行列式 ------')
disp(' ')
disp('--- | a11  a12 | ------')
disp('--- | a21  a22 | ------')
A(1:2,1:2)
det(A(1:2,1:2))

disp(' ')
disp('--- | a11  a13 | ------')
disp('--- | a21  a23 | ------')
A(1:2,1:2:3)
det(A(1:2,1:2:3))

disp(' ')
disp('--- | a12  a13 | ------')
disp('--- | a22  a23 | ------')
det(A(1:2,2:3))

disp(' ')
disp('____________________________________________________')
disp('--- v = A*u となる u2, u3 ------')
disp('--- (u = [ u1  u2  u3 ]'',  v = [ v1  v2 ]'') ------')

syms u1 u2 u3 real
syms v1 v2 real
u = [ u1
      u2
      u3 ];
v = [ v1
      v2 ];
eq = A*u - v == 0

[u2 u3] = solve(eq, {u2, u3})

disp(' ')
disp('____________________________________________________')
disp('--- w''*A = 0 となる w = [ w1  w2 ]'' ------')
syms w1 w2 real
w = [ w1 
      w2 ];
eq2 = w'*A == 0

disp('--- w = 0 以外に存在するか？ ------')
assume(w~=0)
[w1 w2] = solve(eq2, {w1, w2})

