disp('++++++++++++++++++++++++++++++')
disp('問題 2.4 (1)（数値計算：関数 ''tf''）')
disp('++++++++++++++++++++++++++++++')

clear
format compact

A = [ 0  1
     -3 -2 ];
b = [ 0
      1 ];
c = [ 1  0 ];
d = 0;

disp(' ')
disp('--- 状態空間表現 ------')
ss_P = ss(A,b,c,d)
disp(' ')
disp('--- 伝達関数表現 ------')
tf_P = tf(ss_P)


disp(' ')
disp('++++++++++++++++++++++++++++++')
disp('問題 2.4 (2)（数値計算：関数 ''tf''）')
disp('++++++++++++++++++++++++++++++')

clear
format compact

A = [ 0  1  0
      0  0  1
     -2 -4 -3 ];
b = [ 0
      0
      1 ];
c = [ 8  4  0 ];
d = 0;

disp(' ')
disp('--- 状態空間表現 ------')
ss_P = ss(A,b,c,d)
disp(' ')
disp('--- 伝達関数表現 ------')
tf_P = tf(ss_P)
