disp('++++++++++++++++++++++++++++++')
disp('例 3.7 (1)')
disp('++++++++++++++++++++++++++++++')

clear
format compact

A = [  0   1
     -10 -11 ];

lambda = eig(A)

if real(lambda) < 0
    disp('漸近安定である')
else
    disp('漸近安定ではない')
end

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
disp(' ')
disp('++++++++++++++++++++++++++++++')
disp('例 3.7 (2)')
disp('++++++++++++++++++++++++++++++')

clear
format compact

A = [  0  1
     -10 -2 ];

lambda = eig(A)

if real(lambda) < 0
    disp('漸近安定である')
else
    disp('漸近安定ではない')
end

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
disp(' ')
disp('++++++++++++++++++++++++++++++')
disp('例 3.7 (3)')
disp('++++++++++++++++++++++++++++++')

clear
format compact

A = [ 0  1
      2 -1 ];

lambda = eig(A)

if real(lambda) < 0
    disp('漸近安定である')
else
    disp('漸近安定ではない')
end
