disp('++++++++++++++++++++++++++++++')
disp('—á 3.7 (1)')
disp('++++++++++++++++++++++++++++++')

clear
format compact

A = [  0   1
     -10 -11 ];

lambda = eig(A)

if real(lambda) < 0
    disp('‘Q‹ßˆÀ’è‚Å‚ ‚é')
else
    disp('‘Q‹ßˆÀ’è‚Å‚Í‚È‚¢')
end

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
disp(' ')
disp('++++++++++++++++++++++++++++++')
disp('—á 3.7 (2)')
disp('++++++++++++++++++++++++++++++')

clear
format compact

A = [  0  1
     -10 -2 ];

lambda = eig(A)

if real(lambda) < 0
    disp('‘Q‹ßˆÀ’è‚Å‚ ‚é')
else
    disp('‘Q‹ßˆÀ’è‚Å‚Í‚È‚¢')
end

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
disp(' ')
disp('++++++++++++++++++++++++++++++')
disp('—á 3.7 (3)')
disp('++++++++++++++++++++++++++++++')

clear
format compact

A = [ 0  1
      2 -1 ];

lambda = eig(A)

if real(lambda) < 0
    disp('‘Q‹ßˆÀ’è‚Å‚ ‚é')
else
    disp('‘Q‹ßˆÀ’è‚Å‚Í‚È‚¢')
end
